{"_id":"imported-continuity","_type":"event","title":"Continuity, a Hard to Re-Read","event_type":"event","event_program":"hardtoread","date":"2022-02-03","start":"19:00","end":"21:00","timezone":"EST","action_label":"Link","action_link":"https://www.youtube.com/watch?v=aphqQpdyfv4&ab_channel=WhiteColumns","text":"Continuity: a Hard to Re-Read inside of “Looking Back, the 12th White Columns Annual – Selected by Mary Manning” \n\nHonoring the work of Sarah Schulman, Etel Adnan, bell hooks, Sylvère Lotringer, SOPHIE, and Greg Tate\n\nWith readings from Sarah Schulman, Alisha Mascarenhas, Muna Mire, Thora Siemsen, Arthur Jafa, and company. Hosted by Fiona Alison Duncan\n\n*Copies of Sarah Schulman’s books “Let the Record Show: A Political History of Act Up New York, 1987-1993,” “The Gentrification of the Mind: Witness to a Lost Imagination,” and “Conflict is Not Abuse: Overstating Harm, Community Responsibility, and the Duty of Repair” will be available for sale with all proceeds forwarded to Palestine Legal, an advocacy group focused on defending people who support Palestinian rights. With thanks to Jackson Howard and Farrar, Straus and Giroux. \n\n*Select texts by Etel Adnan, bell hooks, Sylvère Lotringer, Greg Tate, Dave Hickey, Joan Didion, and Eve Babitz will be also be for sale, with proceeds forwarded to Hard to Read’s operational budget.\n\n“Continuity: a Hard to Re-Read” was organized by Duncan with assistance from Chase Bell\n","slug":{"_type":"slug","current":"continuity"}}
{"_id":"imported-loot-sweets","_type":"event","title":"Loot Sweets","event_type":"event","event_program":"hardtoread","date":"2021-09-12","start":"17:30","end":"20:00","timezone":"EST","action_label":"Link","action_link":"https://www.bridgetdonahue.nyc/exhibitions/hard-read-organized-fiona-alison-duncan-6pm-530-doors/","text":"Hard to Read hosts inside of Martine Syms' solo exhibition Loot Sweets at Bridget Donahue gallery, with live readings from Shailah Edmonds (author of Wild Child to Couture Style), Joon Oluchi Lee (author of Neotenica), and Fernando Cerezo III, as well as Scene Report contributors Martha Oatis and Brent David Freaney. Plus additional videos reading Rocket Caleshu and Martine Syms. With thanks to Erin Leland and Bridget Donahue.","themes":[{"_type":"reference","_ref":"theme_art"},{"_type":"reference","_ref":"theme_comedy"},{"_type":"reference","_ref":"theme_gender"},{"_type":"reference","_ref":"theme_fashion"},{"_type":"reference","_ref":"theme_pleasure"},{"_type":"reference","_ref":"theme_coming-of-age"},{"_type":"reference","_ref":"theme_family"}],"slug":{"_type":"slug","current":"loot-sweets"}}
{"_id":"imported-gentle-hard","_type":"event","title":"Gentle Hard","event_type":"event","event_program":"hardtoread","date":"2021-06-16","text":"What Gentle Hard Reader are You? with Vivien Lee, Cruz Pierre Mendez, Erin Leland and Michael Londres. at Seward Park, New York, NY","themes":[{"_type":"reference","_ref":"theme_gentility"}],"slug":{"_type":"slug","current":"gentle-hard"}}
{"_id":"imported-zero-patience-and-choreography","_type":"event","title":"Zero Patience and Choreography for a Tired Virus","event_type":"event","event_program":"pillowtalk","date":"2020-12-21","end_date":"2020-12-28","timezone":"PST","action_label":"Link","action_link":"https://now-instant.la/screen-16-archive","text":"A satellite screening connected to the Comedy of Erros group show. Pillow Talk presented John Greyson’s feature film Zero Patience alongside Val Breeder’s short Choreography for a Tired Virus at Now-Instant Image Hall. Fundraising for the Toronto Palestine Film Festival ","themes":[{"_type":"reference","_ref":"theme_virality"},{"_type":"reference","_ref":"theme_gossip"},{"_type":"reference","_ref":"theme_comedy"},{"_type":"reference","_ref":"theme_eros"},{"_type":"reference","_ref":"theme_errors"}],"slug":{"_type":"slug","current":"zero-patience-and-choreography"}}
{"_id":"imported-comedy-of-erros","_type":"event","title":"Comedy of Erros","event_type":"exhibition","event_program":"pillowtalk","date":"2020-11-21","end_date":"2021-01-30","action_label":"Link","action_link":"https://stars-gallery.com/exhibitions/comedy-of-erros-organized-by-fiona-duncan-alison-as-part-of-pillow-talk/","text":"“Silver linings rain or shine \nThat little red squiggle \nOnly catches me sometimes”\n\nComedy of Erros was a group exhibition curated by Fiona Alison Duncan as an expression of Pillow Talk. Installed at Christopher Schwartz’s STARS gallery (formerly The Gallery At) in Hollywood, California, Comedy of Erros explored errors and eros, spanning a range of entanglements, from economic to sensuous to linguistic. Originally intended to open on April Fools Day 2020, the show was postponed due to the Covid-19 pandemic. Much of the work in the show, programmed the year prior, synchronized with the 2020 zeitgeist; work about virality, sickness, filth, isolation, interdependence, phallic power (the election) and antiracist, intersectional feminist and sex worker activism. As it happens with Duncan, her chosen theme manifest itself in the creative process; comedic, cathartic, sticky “human folly” conflicts and confusions came up. Most of that is unrelatable, secrets, for now. To give one impersonal example, Comedy of Erros was put back on the calendar during a chill phase of the pandemic, only to open right as viral cases amped waaaaay up in LA. We had our visitors. Many missed out. “Next time I’ll call my show Ease of Grace!” Duncan didn’t joke. Haha. It’s life, wherein errors resolved deepen relationships and better work. \n\nIn the end, Comedy of Erros featured artists from five nations of North America: Canada, Mexico, the U.S., the Mi’kmaq First Nations, and the Tohono O’odham Nation. Pippa Garner was the poster girl. Photographed naked by Clifford Prince King, she exhibited one of God’s discarded human prototypes as a sculpture. SoiL Thornton presented a body-safe sex toy cast from dirt, mountable, vibrating, it was made thanks to local pleasure product manufacturer Doc Johnson. Painter Sojourner Truth Parsons exhibited balloons and writing, a rarity. Duncan asked for it. Helium leaks over time, Parsons work went from buoyancy to deflation, like written language’s life cycle (the balloons are red-inflatable). We also had Vaquera, Val Breeder, Takako Yamaguchi, Reynaldo Rivera, Neke Carson, Matt Kenny, John Greyson, Ishi Glinsky, and Fernando Mendez Corona. With archival materials on Ilona Staller and Florynce ‘Flo’ Kennedy, care of The Los Angeles Public Library and the Schlesinger Library at the Radcliffe Institute, Harvard University.","themes":[{"_type":"reference","_ref":"theme_comedy"},{"_type":"reference","_ref":"theme_catharsis"},{"_type":"reference","_ref":"theme_human-folly"},{"_type":"reference","_ref":"theme_failure"},{"_type":"reference","_ref":"theme_virality"},{"_type":"reference","_ref":"theme_errors"},{"_type":"reference","_ref":"theme_eros"},{"_type":"reference","_ref":"theme_interdependence"}],"links":[{"_type":"externalLink","url":"https://www.contemporaryartdaily.com/project/comedy-of-errors-at-the-gallery-at-el-centro-los-angeles-15426","title":"https://www.contemporaryartdaily.com/project/comedy-of-errors-at-the-gallery-at-el-centro-los-angeles-15426"},{"_type":"externalLink","url":"https://www.interviewmagazine.com/art/pippa-garner-and-hayden-dunham-on-the-struggle-of-being-inside-bodies","title":"https://www.interviewmagazine.com/art/pippa-garner-and-hayden-dunham-on-the-struggle-of-being-inside-bodies"},{"_type":"externalLink","url":"https://novembre.global/magazine/pillow-talk-s-comedy-of-erros-by-fiona-alison-duncan","title":"https://novembre.global/magazine/pillow-talk-s-comedy-of-erros-by-fiona-alison-duncan"},{"_type":"externalLink","url":"https://www.lofficielusa.com/art/impact-of-crafts-contemporary-art-pop-culture","title":"https://www.lofficielusa.com/art/impact-of-crafts-contemporary-art-pop-culture"},{"_type":"externalLink","url":"https://stars-gallery.com/newsletters/the-secret-written-on-your-torso/","title":"https://stars-gallery.com/newsletters/the-secret-written-on-your-torso/"}],"slug":{"_type":"slug","current":"comedy-of-erros"}}
{"_id":"imported-texture","_type":"event","title":"Texture","event_type":"event","event_program":"hardtoread","date":"2020-08-31","start":"19:00","end":"21:00","timezone":"EST","action_label":"Link","action_link":"https://girlscallmurder.com/events/nightboat-books-hard-to-read-present-texture","text":"Co-presented with Nightboat, an evening of readings on the Texture of text. Featuring Nightboat authors and editors Cyrée Jarelle Johnson, Joon Oluchi Lee, Xandria Phillips, and Ellis Martin and Zach Ozma, as well as Hard to Read's Chase Bell, who screened a short film. Hosted by Fiona Alison Duncan and Nightboat's Caelan Nardone. All of the authors who read (and Duncan) received LAMBDA Literary Awards this year or the next. ","themes":[{"_type":"reference","_ref":"theme_gay"},{"_type":"reference","_ref":"theme_texture"},{"_type":"reference","_ref":"theme_form"},{"_type":"reference","_ref":"theme_lambda"}],"slug":{"_type":"slug","current":"texture"}}
{"_id":"imported-allusions","_type":"event","title":"Allusions","event_type":"event","event_program":"hardtoread","date":"2020-07-17","start":"19:00","end":"21:00","timezone":"CET","action_label":"Link","action_link":"https://dittrich-schlechtriem.com/artists/jonas-wendelin/","text":"ALLUSIONS, co-presented with artist Jonas Wendelin, brought together a collection of readers from the newspaper THE ALLUSION that Wendelin created as part of their show at ONLY at Dittrich & Schlechtriem gallery in Berlin, Germany. Readers included Analisa Teachworth, Hayden Dunham, Fiona Alison Duncan, and Milos Trakilovic, with Chase Bell lending their voice and giving context. ","themes":[{"_type":"reference","_ref":"theme_news-media"},{"_type":"reference","_ref":"theme_water"},{"_type":"reference","_ref":"theme_decay"},{"_type":"reference","_ref":"theme_apocalypse"}],"slug":{"_type":"slug","current":"allusions"}}
{"_id":"imported-horniness-in-crisis","_type":"event","title":"Horniness in Crisis","event_type":"event","event_program":"pillowtalk","date":"2020-05-16","action_label":"Link","action_link":"https://youtu.be/8b2S5Q5IsKI","text":"The topic was Horniness in Crisis. Zoom was still novel (it was was Amalia’s first time). We had no idea what was going on, let alone what would happen. Jamieson Webster spoke on ‘Brutal Lion Infanticide and Mating’ and a little on volunteering in hospitals during the early weeks of the pandemic. Andrew Blackley was late, though his one liners and backstage insight made up for it. Natasha MH recommended books on theme. Alana, Patrick, and Mara were candid. Campbell Carolan dragged as Trad Wives. Energy orgasm expert Suzanne Sutton listened, too sick to speak. Victoria luckily had videos of Suzanne taken in their home. Reba Maybury teased us with what she was working on (much of that is redacted for privacy or future surprise). Hosted by Fiona Alison Duncan","themes":[{"_type":"reference","_ref":"theme_horniness"},{"_type":"reference","_ref":"theme_crisis"}],"slug":{"_type":"slug","current":"horniness-in-crisis"}}
{"_id":"imported-pda-part-two","_type":"event","title":"PDA Part 2","event_type":"event","event_program":"pillowtalk","date":"2020-04-02","action_label":"Link","action_link":"https://youtu.be/WAqftwQHgnQ","text":"“PDA Part 2” is a reprise of a theme we presented last April on pleasure/privacy, domesticity/display, and the apocalypse. This event will ask and answer questions like: Did you pay your rent? What actions can we take to not? What are WAGES FOR HOUSEWORK/QUARANTINE? Who is at home in the home and to whom is this new? How are hookup apps & other public/private technologies like ZOOM finding new uses & abuses in our current? Are we all hot selfie influencers now? What are your favorite sick domestic films (SAFE, Jeanne Dielman, Repulsion, The Landlord [1970]...)? Are you redecorating? Is your domesticity a performance? Do you have a live witness? Are you producing privacy? For public consumption? Does it make you feel less alone? With speakers Hari Nef, Nicholas Korody, Tracy Jeanne Rosenthal, Alana Johnson, Sarah Nicole Prickett, Devan Diaz, Ripley Soprano of BRUJAS, Dozie Kanu, and Leslie Regan Shade","themes":[{"_type":"reference","_ref":"theme_privacy"},{"_type":"reference","_ref":"theme_covid"},{"_type":"reference","_ref":"theme_housework"},{"_type":"reference","_ref":"theme_quarantine"},{"_type":"reference","_ref":"theme_performance"},{"_type":"reference","_ref":"theme_publicity"}],"slug":{"_type":"slug","current":"pda-part-two"}}
{"_id":"imported-scripts-for-the-pageant","_type":"event","title":"Scripts for the Pageant","event_type":"event","event_program":"hardtoread","date":"2020-02-20","start":"18:00","end":"20:00","timezone":"PST","action_label":"Link","action_link":"https://www.mcasd.org/exhibitions/nancy-lupo-scripts-pageant","text":"Organized by Fiona Alison Duncan and Nancy Lupo, this reading unfolded a set of connections embedded in Lupo’s solo show at the Museum of Contemporary Art San Diego SCRIPTS FOR THE PAGEANT, within which the event was hosted. Joining Duncan and Lupo were filmmaker Babette Mangolte (Selected Writings, 1998-2015); writer Alvin Li (who read via FaceTime from Shanghai, since early Covid-19 lockdown prohibited him from leaving China), as well as poets Sandra Doller (Leave Your Body Behind) and Ariana Reines (The Cow, A Sand Book). ","themes":[{"_type":"reference","_ref":"theme_art"},{"_type":"reference","_ref":"theme_noise"},{"_type":"reference","_ref":"theme_space"},{"_type":"reference","_ref":"theme_violence"},{"_type":"reference","_ref":"theme_spatial-politics"},{"_type":"reference","_ref":"theme_animals"}],"slug":{"_type":"slug","current":"scripts-for-the-pageant"}}
{"_id":"imported-montez-press-chase-bell","_type":"event","title":"Hard to Read on Montez Press Radio Residency 2","event_type":"event","event_program":"hardtoread","date":"2020-01-29","end_date":"2020-12-31","timezone":"EST","action_label":"Link","action_link":"https://radio.montezpress.com/#/archive","text":"During 2020, Fiona Alison Duncan and Chase Bell committed to producing one radio show per month for Montez Press Radio. Guests included Rosa Aiello, Simone Browne, M. Elizabeth Scott, Adam Verdes, Angelo Lanza, and Alexis Blair Penney, among others.","themes":[{"_type":"reference","_ref":"theme_radio"}],"slug":{"_type":"slug","current":"montez-press-chase-bell"}}
{"_id":"imported-revolutionary-letters","_type":"event","title":"Revolutionary Letters","event_type":"event","event_program":"hardtoread","date":"2020-01-29","start":"21:00","end":"23:00","timezone":"EST","action_label":"Link","action_link":"https://radio.montezpress.com/#/archive","text":"A Communal Reading of Diane di Prima and work inspired by her Revolutionary Letters featuring live readings from Larissa Pham, Conor Tomas Reed, Chase Bell, Stacy Skolnik, Ripley Soprano, and Claire DeVoog’d, among others surprise guests, plus audio readings from Fabiola Ching, Colin Self, Alexis Penney, and more. Co-curated and hosted by Chase Bell. Organized and hosted by Fiona Alison Duncan. This event fundraised for Moms 4 Housing in the Bay, where Diane di Prima was in residence. Recorded in Montez Press Radio studios in Chinatown, New York. ","themes":[{"_type":"reference","_ref":"theme_revolution"},{"_type":"reference","_ref":"theme_poetry"},{"_type":"reference","_ref":"theme_communion"}],"slug":{"_type":"slug","current":"revolutionary-letters"}}
{"_id":"imported-kids-on-animals","_type":"event","title":"Hard to Read KIDS: on Animals","event_type":"event","event_program":"hardtoread","date":"2020-01-05","start":"15:00","end":"17:00","timezone":"PST","text":"Crafts, snacks, and kid’s lit readings lead by artists Alake Shilling and Flannery Silva hosted the El Centro Apartments & Bungalows. Organized by Fiona Alison Duncan\n","themes":[{"_type":"reference","_ref":"theme_kids"},{"_type":"reference","_ref":"theme_animals"}],"slug":{"_type":"slug","current":"kids-on-animals"}}
{"_id":"imported-class-acts","_type":"event","title":"Class Acts","event_type":"event","event_program":"hardtoread","date":"2019-12-17","start":"19:00","end":"21:00","timezone":"GMT","action_label":"Link","action_link":"https://www.mimosahouse.co.uk/past-events/2019/12/17/mal-journal-x-hard-to-read-class-acts","text":"On the occasion of \"A Silenced Victory\", a solo exhibition by a renowned Italian poet and artist Tomaso Binga, Mimosa House invited Mal Journal and Hard to Read to present an evening of readings, screenings and installations, reflecting on class, sexuality and the commons. Class Acts. Participants include Fiona Alison Duncan, Huw Lemmey, Reba Maybury, Eileen Myles, Natasha Stagg, Monique Todd (Pleasure Principles) and Clem Macleod (Worms).","themes":[{"_type":"reference","_ref":"theme_class"},{"_type":"reference","_ref":"theme_sexuality"},{"_type":"reference","_ref":"theme_performance"},{"_type":"reference","_ref":"theme_the-commons"},{"_type":"reference","_ref":"theme_brexit"}],"slug":{"_type":"slug","current":"class-acts"}}
{"_id":"imported-crown-neck-root","_type":"event","title":"Crown, Neck, Root","event_type":"event","event_program":"hardtoread","date":"2019-11-03","start":"17:00","end":"20:00","timezone":"PST","action_label":"Link","action_link":"https://www.currentla.org/artists/nancy-lupo/","text":"Crown, Neck, Root. With Norman M. Klein, Reynaldo Rivera, Nancy Lupo, Michael Kearns representing John Rechy, the writings of David Rattray performed by Mercedes Kilmer and others. Hosted within Nancy Lupo’s Open Mouth, an installation of custom benches with rounded end elements that resemble teeth, located at Pershing Square in Downtown Los Angeles. The benches are arranged in a configuration that resembles a diagrammatic adult human mouth. The work is a stage for viewing, meeting, and thinking about the metabolism of the city. \n\nThis reading and performance explored themes of excavation, regeneration, consecration, and disappearance—inspired by Lupo’s installation and its site, Pershing Square. Featuring original writings by Norman M. Klein, author of The History of Forgetting: Los Angeles and the Erasure of Memory and Tales of the Floating Class; artist Reynaldo Rivera (Provisional Notes on a Disappeared City, Semiotexte, 2020); artists Nancy Lupo and Camille Clair; Robbie Dewhurst and Mercedes Kilmer representing the late poet and translator David Rattray (How I Became One of the Invisible); and actor, writer, and activist Michael Kearns performing from John Rechy’s City of Night. With a soundtrack by Cucurucha (Alix Van Der Donckt-Ferrand). Hosted by author Fiona Alison Duncan (Exquisite Mariposa). Organized by Nancy Lupo and Fiona Alison Duncan.","themes":[{"_type":"reference","_ref":"theme_excavation"},{"_type":"reference","_ref":"theme_regeneration"},{"_type":"reference","_ref":"theme_consecration"},{"_type":"reference","_ref":"theme_disappearance"}],"slug":{"_type":"slug","current":"crown-neck-root"}}
{"_id":"imported-kids-time","_type":"event","title":"Hard to Read KIDS: on Time","event_type":"event","event_program":"hardtoread","date":"2019-11-03","action_label":"Link","action_link":"https://elcentrohollywood.com/","text":"Hard to Read KIDS on TIME with librarian Alana Johnson and artist Spencer Longo ","themes":[{"_type":"reference","_ref":"theme_kids"}],"slug":{"_type":"slug","current":"kids-time"}}
{"_id":"imported-kids-jazz-poetics","_type":"event","title":"Hard to Read KIDS: on Jazz & Poetics","event_type":"event","event_program":"hardtoread","date":"2019-10-20","action_label":"Link","action_link":"https://elcentrohollywood.com/","text":"Hard to Read's first ever KIDS event on Jazz & Poetics hosted by Harmony Holiday","themes":[{"_type":"reference","_ref":"theme_kids"}],"slug":{"_type":"slug","current":"kids-jazz-poetics"}}
{"_id":"imported-nyfw-special","_type":"event","title":"NYFW Special","event_type":"event","event_program":"hardtoread","date":"2019-09-08","start":"19:00","end":"20:30","timezone":"EST","text":"A New York Fashion Week Special with writers Jordan Barse (on perfume conspiracy theories) and Eugenie Dalland (on the legacy of Isabel Toledo). At McNally Jackson Books, Seaport location.","themes":[{"_type":"reference","_ref":"theme_fashion"},{"_type":"reference","_ref":"theme_conspiracy"},{"_type":"reference","_ref":"theme_legacy"}],"slug":{"_type":"slug","current":"nyfw-special"}}
{"_id":"imported-malina","_type":"event","title":"Malina","event_type":"event","event_program":"hardtoread","date":"2019-08-22","action_label":"Link","action_link":"https://now-instant.la/malina","text":"HARD TO READ presents \n\nWerner Schroeter’s MALINA \n\nwith introductions from\nSarah Nicole Prickett & Rachel Kushner \n\ncelebrating the re-release of\nIngeborg Bachmann’s novel, MALINA, from NEW DIRECTIONS PRESS\n\nThursday, August 22nd at 8PM\nNow Instant Image Hall\n\n5319 York Blvd, Los Angeles, CA\n$10 tickets at the door\n\nBooks available for sale","themes":[{"_type":"reference","_ref":"theme_film"}],"links":[{"_type":"externalLink","url":"https://www.youtube.com/watch?v=06MijbNFz1c&t=7s&ab_channel=FionaAlisonDuncan","title":"https://www.youtube.com/watch?v=06MijbNFz1c&t=7s&ab_channel=FionaAlisonDuncan"}],"slug":{"_type":"slug","current":"malina"}}
{"_id":"imported-saltc-la","_type":"event","title":"SALTC (Sex and Love in the City) Los Angeles\n","event_type":"event","event_program":"pillowtalk","date":"2019-07-20","start":"19:00","end":"22:00","timezone":"PST","action_label":"Link","action_link":"https://www.youtube.com/watch?v=7Bxbc3Qc5IY&t=1782s&ab_channel=FionaAlisonDuncan","text":"PILLOW TALK PRESENTED SALTC (SEX AND LOVE IN THE CITY) LOS ANGELES, a LIVE(streamed) EVENT at the El Centro Apartments & Bungalows in Hollywood, California. With live contributions from writer, dancer, activist, and educator Antonia Crane; dancer, stylist, and creative consultant (No Sesso) Autumn Randolph; musician, artist, and organizer Bapari; activist, artist, and organizer Blaine O’Neill; artist, writer, bodyworker Elizabeth Marcus Sonenberg;  and ecofetishist artists Themba and Genevieve of Sacred Sadism\n\nWith media contributions from Alexa Karolinski and Eckhaus Latta, artist Amalia Ulman (Shanghai Fire), Hard to Read, artist Mara McKevitt, artist filmmaker Margaret Haines, former Uber drivers Dylan Kimbrell and Alexandra Crotta, and more! This event was directed by Fiona Alison Duncan and Mara McKevitt\n\nSuggested donations to the Los Angeles Coalition for Reproductive Justice, the TransLatin@ Coalition, and FreeFrom.org","themes":[{"_type":"reference","_ref":"theme_sex"},{"_type":"reference","_ref":"theme_love"},{"_type":"reference","_ref":"theme_los-angeles"},{"_type":"reference","_ref":"theme_cities"}],"slug":{"_type":"slug","current":"saltc-la"}}
{"_id":"imported-iku","_type":"event","title":"I.K.U. by Shu Lea Cheang\n","event_type":"event","event_program":"pillowtalk","date":"2019-07-17","start":"20:00","end":"22:00","timezone":"PST","action_label":"Link","action_link":"https://now-instant.la/pillow-talk-iku","text":"In conjunction, with SALTC NY + SALTC LA, Pillow Talk presents a screening of artist Shu Lea Cheang's future Tokyo sci-fi porno IKU. A film screening at Now-Instant Image hall.","themes":[{"_type":"reference","_ref":"theme_tokyo"},{"_type":"reference","_ref":"theme_scifi"},{"_type":"reference","_ref":"theme_sex"},{"_type":"reference","_ref":"theme_future"},{"_type":"reference","_ref":"theme_cities"}],"slug":{"_type":"slug","current":"iku"}}
{"_id":"imported-saltc-ny","_type":"event","title":"SALTC (Sex and Love in the City) New York","event_type":"event","event_program":"pillowtalk","date":"2019-07-07","start":"15:00","end":"20:00","timezone":"EST","action_label":"Link","action_link":"https://www.youtube.com/watch?v=pcAG5hqtL5I&ab_channel=FionaAlisonDuncan","text":"PILLOW TALK PRESENTED SALTC (SEX AND LOVE IN THE CITY) NEW YORK\n3:00-5:00PM EST LIVE (PRIVATE) EVENT\n5:00-7:00PM EST (PUBLIC) INSTANT REPLAY\nat the Kimpton Hotel Eventi (851 6th Ave, New York, NY)\n\nHosted and directed by Fiona Alison Duncan and Mara McKevitt\n\nWith live contributions from personal trainer Dion Olivier of Flux Vitality, artist and fashion writer Jordan Barse, author Natasha Stagg (Surveys, Sleeveless), and artist Valentina Vaccarella\n\nMedia contributions from Alexa Karolinski and Eckhaus Latta, model and artist Alicia Novella Vasquez (wearing Women’s History Museum), former gallerist Bianca Lanza, musician Chicken, organizer Fiona Alison Duncan, psychoanalyst and author Jamieson Webster, musician Lauren Devine, designer Lou Dallas, artist Mara McKevitt, artist and designer Martina Cox, musician Ren G, musician Riich Psycho (Ajakia Smith), author Samuel R. Delany (Times Square Red, Times Square Blue), skaters Stephen Ostrowski and Cooper Winterson, and artist Torey Thornton, and more Love-streamed care of Matthew Doyle","themes":[{"_type":"reference","_ref":"theme_sex"},{"_type":"reference","_ref":"theme_love"},{"_type":"reference","_ref":"theme_new-york"},{"_type":"reference","_ref":"theme_cities"},{"_type":"reference","_ref":"theme_hypercapitalism"}],"slug":{"_type":"slug","current":"saltc-ny"}}
{"_id":"imported-pda-hollywood-housewarming","_type":"event","title":"PDA, a Hollywood housewarming","event_type":"event","event_program":"pillowtalk","date":"2019-04-25","start":"19:00","end":"22:00","text":"Pillow Talk presents PDA, a Hollywood housewarming exploring publicity, privacy, pleasure, and architecture, from domestic interiors to the space of focussed consciousness. Featuring contributions from: architectural theorist Nicholas Korody, on the design of Studio 20; Lizzie Borden with her film Working Girls; Alexis Blair Penney, who gave a tour through queer housing collectives they’ve lead, and answer any questions you have on negotiating communal living; and finally, introducing @cutiereadergirl, anonymous as always.\n\nThis semi-private event will take place in a Hollywood Blvd facing apartment that Pillow Talk will occupy all year. Space is limited. If you’re interested in attending, please RSVP to fad@hardtoread.us. Details on how to get in will be delivered within 48 hours of the event.\n\nFounded by Fiona Alison Duncan, Pillow Talk is the sex and love spinoff of her lit series Hard to Read. This year of Pillow Talk events, co-curated by Mara McKevitt, will happen in Manhattan and Hollywood.\n\n*\n\nPillow Talk\n\nPurposeful Discursive Angels\nPracticing Dignity and Amity\n\npresents PDA\n\nPublicity Displacing Affection\nPubic Directed Attention\nPleasure-Divining Accommodations\nPoetry Dogging Advertising\n\nPower, Domesticity, Alienation\nProperty, Delusion, Authority\nPrivacy, Disorder, Apocalypse\n\n(It’s a) Party Deflowering (in-kind) Architecture Presently Devoted to…","themes":[{"_type":"reference","_ref":"theme_publicity"},{"_type":"reference","_ref":"theme_privacy"},{"_type":"reference","_ref":"theme_domesticity"},{"_type":"reference","_ref":"theme_architecture"}],"slug":{"_type":"slug","current":"pda-hollywood-housewarming"}}
{"_id":"imported-business-or-leisure","_type":"event","title":"Business or Leisure?","event_type":"event","event_program":"hardtoread","date":"2019-04-23","start":"19:00","end":"22:00","text":"Business or Leisure, hosted during a pleasurable work trip. With readers Amelian Kashiro, an. cinquepalmi, Ikechukwu Onyewuenyi, and Tracy Jeanne Rosenthal at the Standard, Downtown LA","themes":[{"_type":"reference","_ref":"theme_business"},{"_type":"reference","_ref":"theme_leisure"},{"_type":"reference","_ref":"theme_work"},{"_type":"reference","_ref":"theme_rest"}],"slug":{"_type":"slug","current":"business-or-leisure"}}
{"_id":"imported-a-tease-thats-a-bond","_type":"event","title":"A Tease That’s a Bond, Not a Separation","event_type":"event","event_program":"hardtoread","date":"2019-02-19","start":"19:00","end":"22:00","action_label":"Link","action_link":"http://www.fragile.berlin/hard-to-read","text":"A TEASE THAT’S A BOND, NOT A SEPARATION — HARD TO READ AT FRAGILE IN BERLIN!\nHosted by Fiona Alison Duncan\n\nWith\nAlix Van Der Donckt-Ferrand\nDan Bodan\nEoghan Ryan\nMahsa Saloor\nNovembre\nTarren Johnson\n3lsn3r\n\nFRAGILE hosts Hard to Read’s first event in Europe. « A tease that’s a bond, not a separation » is an evening of readings on beauty, disgust, tension, movement, and the moment. Featuring video contributions by artists Eoghan Ryan and Alix Van Der Donckt-Ferrand, alongside live shares by choreographer and artist Tarren Johnson, writer and artist Mahsa Saloor, musician Dan Bodan, and flower and fruit 3lsn3r, a newborn persona who will read a series of letters on beauty (by Natasha Stagg, Fabian Marti, Jamieson Webster, Torey Thornton, and more) co-curated by Hard to Read for Novembre’s latest issue.\n\nTexts will be available for sale, among them Novembre magazine, Pyre Fiction, and Alix Van Der Donckt-Ferrand’s F/W'18-19 Ready-to-read by Hard to Read poetry zine, from which the title « A tease that’s a bond, not a separation » (words by Gerald Vizenor) was drawn.","themes":[{"_type":"reference","_ref":"theme_song"}],"slug":{"_type":"slug","current":"a-tease-thats-a-bond"}}
{"_id":"imported-fanny-howe-fan-club","_type":"event","title":"Fanny Howe Fan Club Meeting","event_type":"event","event_program":"hardtoread","date":"2019-02-03","start":"14:00","end":"16:00","text":"In lieu of church, fans of mystic Fanny Howe (Love A Loves Me!’s bestseller poet/author) will meet for a first, and maybe not last, time. We’ll have a broad selection of books by Howe on hand, including the out-of-print Radical Love and Forty Whacks, rare 1971 erotica by the author. Devotees and newcomers to Howe’s work are equally encouraged to come. Coffee and cookies will be served. (Fanny Howe Fan Club tees are available in custom preorder only, to be fulfilled in time for the meeting.)","themes":[{"_type":"reference","_ref":"theme_fanny-howe"},{"_type":"reference","_ref":"theme_mysticism"},{"_type":"reference","_ref":"theme_poetry"}],"slug":{"_type":"slug","current":"fanny-howe-fan-club"}}
{"_id":"imported-at-the-very-least","_type":"event","title":"At the Very Least, a Roundtable","event_type":"event","event_program":"hardtoread","date":"2019-02-01","start":"18:00","end":"20:00","text":"Love A Loves Me! reader Fabiola Ching hosts At the Very Least, a round table on the protection and value systems surrounding black women and our creations (and health, safety, time!) in order to guarantee longevity, accessibility, currency, and autonomy—while alive and after. Other conversation points include: communing across the net, working and sharing within a rigged grid, and loneliness. With special ode to author Bessie Head, featuring an altar and books for sale.","themes":[{"_type":"reference","_ref":"theme_race"},{"_type":"reference","_ref":"theme_health"},{"_type":"reference","_ref":"theme_accessibility"}],"slug":{"_type":"slug","current":"at-the-very-least"}}
{"_id":"imported-writing-at-work","_type":"event","title":"Writing at Work\n","event_type":"event","event_program":"hardtoread","date":"2019-01-24","start":"20:00","end":"22:00","text":"A reading on Writing at Work. A re-opening celebration of Hard to Read's exhibit Love A Loves Me! at Jeffrey Stark gallery. Featuring Alicia Novella Vasquez, Fabiola Ching, Fiona Alison Duncan, Jamieson Webster, and Kaitlin Phillips as Janet Malcolm. In the mall atrium. ","themes":[{"_type":"reference","_ref":"theme_writing"},{"_type":"reference","_ref":"theme_work"},{"_type":"reference","_ref":"theme_labor"},{"_type":"reference","_ref":"theme_industry"}],"slug":{"_type":"slug","current":"writing-at-work"}}
{"_id":"imported-gary-indiana-vile-happy","_type":"event","title":"Gary Indiana: Vile Days and a Happy End","event_type":"event","event_program":"hardtoread","date":"2019-01-15","start":"18:30","end":"23:00","text":"Gary Indiana, author of contemporary malaise, joins host Fiona Alison Duncan at the Standard, Hollywood for a night of readings, talk, and cinema. \n\nFor its first event of 2019, Hard to Read is celebrating the work and person of Gary Indiana, including the recent release of Vile Days, a collection of his 1985-1988 Village Voice art columns (edited by Bruce Hainley, for Semiotexte), as well as the re-releases of his novels Horse Crazy and Gone Tomorrow (Seven Stories Press). \n\nAfter a reading and discussion of Indiana’s work in the Cactus Lounge, we’ll move to the Lobby, where Duncan and Indiana will host the hotel’s weekly Cine-Situation event, screening a film of Indiana’s choosing: Michael Haneke’s 2017 Happy End, starring Isabelle Huppert and Jean-Louis Trintignant.  ","slug":{"_type":"slug","current":"gary-indiana-vile-happy"}}
{"_id":"imported-disco-files","_type":"event","title":"The Disco Files","event_type":"event","event_program":"hardtoread","date":"2018-12-16","start":"14:00","end":"22:00","action_label":"Link","action_link":"https://www.facebook.com/events/207036810208163/","text":"Hard To Read presents \nThe Disco Files\n\nHard To Read celebrates the newly published expanded edition of Vince Aletti's classic document of the early years of disco music and culture, guest-curated by Prince Language.\n\nFeaturing the legendary Danny Krivit playing a special 6-hour set of music exclusively from 1973-78, the period over which Vince Aletti was writing the original Disco Files column in Record World magazine.\n\nPreceded by:\n- a Q&A with Vince Aletti conducted by White Columns gallery Director Matthew Higgs.\n\n- Morgan Bassichis reading from Douglas Crimp's Disss-Co (A Fragment).\n\n- a brief reading from Andrew Holleran's classic novel Dancer From The Dance, which contains probably the earliest fictionalized depiction of New York's underground discos of the mid-1970s.\n\nVince Aletti will be signing copies of The Disco Files following the Q&A and readings.\n\nCopies of the Disco Files as well as related titles will be for sale onsite from 2-4pm by Aeon Bookstore. \n\nA limited number of copies of Love Injection Issue #43, featuring a cover interview with Vince Aletti, will be available on a first-come, first-served basis.","themes":[{"_type":"reference","_ref":"theme_disco"},{"_type":"reference","_ref":"theme_dance"},{"_type":"reference","_ref":"theme_music"}],"slug":{"_type":"slug","current":"disco-files"}}
{"_id":"imported-family-stories","_type":"event","title":"Family: Stories About Our Absurd Units","event_type":"event","event_program":"hardtoread","date":"2018-11-15","start":"19:00","end":"21:00","text":"Family: Stories About Our Absurd Units. This Hard to Read event was guest curated & hosted by Tierney Finster\nwith Michelle Badillo, Justice Singleton, Emily Barker, Heather Jewett, and Kris Kidd. At the Standard, Hollywood.","themes":[{"_type":"reference","_ref":"theme_family"}],"slug":{"_type":"slug","current":"family-stories"}}
{"_id":"imported-love-a-loves-me","_type":"event","title":"Love A Loves Me!","event_type":"exhibition","event_program":"hardtoread","date":"2018-11-04","end_date":"2019-02-15","action_label":"Link","action_link":"http://jeffreystark.nyc/project/current/","text":"Jeffrey Stark gallery presents Love A Loves Me! \n\n‘Backstory: He told me that when he lived in Queens in the 1970s the streets were covered with the word “BOOK.” It took awhile of wondering before he asked someone and learned that this was how the city dealt with all the “FUCK” graffiti.’\n \nFor her first show as Hard to Read, organizing artist Fiona Alison Duncan asked 14 notable readers in her life to read favorite passages from favorite books. She filmed these readers—individuals she’s exchanged or discussed books with, including herself—in their homes, studios, or a public setting of their choosing. A film of these readings played in the window of the gallery, where Duncan performed the role of bookshopkeep. All of the books read from were available for sale; and inscribed upon purchase with a handwritten message from their reader via wooden stamps that otherwise line the gallery window, looking like meditation blocks. Printed matter containing writing and art by the readers was also available. A series of “Writing on the Wall—” authored by F.A. Duncan, the poet; Fiona Alison Duncan, the mainstay; and Fifi, the fun one—explored language as a tool for domination, seduction, liberation, grace, and what else? While “The Big Book (Gestures of Cumfort)” from reader and artist Matthew Hilvers provided a much needed resting place. Events were held. While attending, Duncan read all of Balzac’s Lost Illusions. \n\nFeaturing video readings by Alicia Novella Vasquez, Amalia Ulman, Ana Cecilia Alvarez, Chris Kraus, Fabiola Ching, Fanny Howe, Fiona Alison Duncan, Gary Indiana, Hedi El Kholti, Ian Duncan, John Edmonds, Margaret Haines, Matthew Hilvers, Sarah Nicole Prickett, and Stefan Schwartzman. \n\nWith books and writing by Alexandre Bisson, Alicia Novella Vasquez, Amalia Ulman, Chris Kraus, David Abram, Essex Hemphill (ed.), Fanny Howe, Fiona Alison Duncan, Gary Indiana, Guillaume Dustan, Hedi El Kholti, Herman Melville, Iceberg Slim, Ingo Niermann (ed), Jenny Diski, John Edmonds, Laurie Weeks, Margaret Haines, Matthew Hilvers, Robert Ulanowicz, Samuel Delany, Sarah Nicole Prickett, Stéphane Mallarmé, and William Gaddis. Books-in-print provided in partnership with McNally Jackson. \n\n“Love a smooth paved road, \na hungover coffee, \na consuming novel, \na lilac in fall…” \n\nBusiness Hours:\nThursdays & Fridays 4-7pm\nSaturday & Sundays 1-4pm ","themes":[{"_type":"reference","_ref":"theme_fan"},{"_type":"reference","_ref":"theme_networks"},{"_type":"reference","_ref":"theme_reading-is-over"},{"_type":"reference","_ref":"theme_family"},{"_type":"reference","_ref":"theme_intimacy"},{"_type":"reference","_ref":"theme_language-as-a-tool"},{"_type":"reference","_ref":"theme_comfort"},{"_type":"reference","_ref":"theme_home"}],"links":[{"_type":"externalLink","url":"https://lithub.com/at-hard-to-read-everybodys-a-writer-and-everybodys-a-reader/","title":"https://lithub.com/at-hard-to-read-everybodys-a-writer-and-everybodys-a-reader/"},{"_type":"externalLink","url":"https://novembre.global/magazine/less-than-em-greater-than-angelo-lanza-the-man-behind-jeffrey-stark-less-than-em-greater-than-by-torey-thornton","title":"https://novembre.global/magazine/less-than-em-greater-than-angelo-lanza-the-man-behind-jeffrey-stark-less-than-em-greater-than-by-torey-thornton"},{"_type":"externalLink","url":"https://www.artforum.com/artguide/jeffrey-stark-14328/love-a-loves-me-162710","title":"https://www.artforum.com/artguide/jeffrey-stark-14328/love-a-loves-me-162710"},{"_type":"externalLink","url":"https://www.youtube.com/watch?v=VnaazX_2y80&ab_channel=FionaAlisonDuncan","title":"https://www.youtube.com/watch?v=VnaazX_2y80&ab_channel=FionaAlisonDuncan"}],"slug":{"_type":"slug","current":"love-a-loves-me"}}
{"_id":"imported-coming-out-like-a-pornstar","_type":"event","title":"Coming Out Like a Pornstar","event_type":"event","event_program":"pillowtalk","date":"2018-11-01","text":"Coming Out Like a Pornstar. ​Tierney Finster guest curates and hosts Jiz Lee with Lotus Lain and Milcah Halili (in the Penthouse Suite of the Standard, Downtown LA).","themes":[{"_type":"reference","_ref":"theme_coming-out"},{"_type":"reference","_ref":"theme_porn"}],"slug":{"_type":"slug","current":"coming-out-like-a-pornstar"}}
{"_id":"imported-pippa-garner","_type":"event","title":"Pippa Garner","event_type":"event","event_program":"pillowtalk","date":"2018-10-18","text":"Pippa!​ Artist Pippa Garner hosted, talk show style, by Fiona Alison Duncan (in the Penthouse Suite of the Standard, Downtown LA).","themes":[{"_type":"reference","_ref":"theme_art"}],"slug":{"_type":"slug","current":"pippa-garner"}}
{"_id":"imported-duets-anniversary","_type":"event","title":"DUETS, a 2 Year Anniversary Party","event_type":"event","event_program":"hardtoread","date":"2018-10-16","start":"19:00","end":"22:00","text":"DUETS. Hard to Read turns Terrible this month! TWO. Can we keep it up, or will we slide into ruin like many ambitious projects before us? In the last 2 years, Hard to Read has put on 34 events in 4 cities, presented 7 collections of books, and launched a sister series, Pillow Talk, which we <3 <3 <3 <3 For our anniversary party, we’re returning to the plush pink lobby of The Standard, Downtown LA where it all began with an event themed DUETS. We’ll be playing records by our fav local duet band, Odwalla 1221; screening a video by Brook Hsu + Abbe Findley; listening to performance readings by Bebe Yama + Natalie Williams; offering books as art, and books to buy, by Preteen Gallery + Ready-to-read by Hard to Read; and climaxing with dueting DJs, Buckmonster + Draveng. And more. Hosted by power couple Fiona Duncan + Matthew Hilvers. Come to our party!! ‍","themes":[{"_type":"reference","_ref":"theme_partnership"}],"slug":{"_type":"slug","current":"duets-anniversary"}}
{"_id":"imported-fuck-music","_type":"event","title":"Fuck Music","event_type":"event","event_program":"pillowtalk","date":"2018-09-27","text":"Fuck Music​. A talk and performance on music you want to fuck to, guest curated and hosted by Mandy Harris Williams with Alima Lee, Alexia Riner, and Cameron Wisch (in the Penthouse Suite of the Standard, Downtown LA).","themes":[{"_type":"reference","_ref":"theme_fuck"},{"_type":"reference","_ref":"theme_music"}],"slug":{"_type":"slug","current":"fuck-music"}}
{"_id":"imported-donna-haraway-story-telling","_type":"event","title":"Donna Haraway: Story Telling for Earthly Survival","event_type":"event","event_program":"hardtoread","date":"2018-08-30","start":"20:00","end":"23:00","action_label":"Link","action_link":"http://icarusfilms.com/if-donna","text":"DONNA HARAWAY: STORY TELLING FOR EARTHLY SURVIVAL. Join Navel and Hard to Read for a screening of Fabrizio Terranova’s Story Telling for Earthly Survival, followed by a live Skype Q&A with Donna Haraway conducted by Fiona Alison Duncan. (The Q&A made it onto the DVD edition of the film!)","themes":[{"_type":"reference","_ref":"theme_partnership"},{"_type":"reference","_ref":"theme_environment"},{"_type":"reference","_ref":"theme_earth"}],"links":[{"_type":"externalLink","url":"https://navel.la/","title":"https://navel.la/"}],"slug":{"_type":"slug","current":"donna-haraway-story-telling"}}
{"_id":"imported-personal-best","_type":"event","title":"Personal Best","event_type":"event","event_program":"pillowtalk","date":"2018-08-21","text":"Personal Best. ​Free screening of the lesbian sport film (at the Standard, West Hollywood)","themes":[{"_type":"reference","_ref":"theme_lesbian"},{"_type":"reference","_ref":"theme_athletics"}],"slug":{"_type":"slug","current":"personal-best"}}
{"_id":"imported-wet","_type":"event","title":"WET 💦  ","event_type":"event","event_program":"hardtoread","date":"2018-08-21","start":"18:00","end":"20:00","text":"HARD TO READ PRESENTS WET 💦 A POOLSIDE READING\nKeep cool with readers Riley O'Neill, Kayla Ephros, and Suavitelpaper, poolside at the Standard, Hollywood (8300 Sunset Blvd). ","themes":[{"_type":"reference","_ref":"theme_wetness"}],"slug":{"_type":"slug","current":"wet"}}
{"_id":"imported-ambition-shame","_type":"event","title":"Ambition and/or Shame","event_type":"event","event_program":"hardtoread","date":"2018-08-17","start":"20:00","end":"23:00","action_label":"Link","action_link":"https://radio.montezpress.com/#/archive","text":"“SHAME LIES ON THE EYELIDS”\nHard to Read presents Ambition and/or Shame\nat Mathew gallery in Chinatown, NY\npart of Montez Press Radio\n\nwith readers Torey Thornton, Eric Linsker, Fiona Alison Duncan, and Matthew Hilvers, plus performances and music from Ajakia Smith aka Riich Psycho and Sadaf","themes":[{"_type":"reference","_ref":"theme_shame"},{"_type":"reference","_ref":"theme_ambition"}],"slug":{"_type":"slug","current":"ambition-shame"}}
{"_id":"imported-sex-love-internet-2","_type":"event","title":"Sex, Love, and the Internet 2","event_type":"event","event_program":"pillowtalk","date":"2018-08-16","text":"On Sex, Love, and the Internet (part 2). ​With Ann Hirsch, Damien Moreau, Kim Ye, Kristin Breanna Cornelius Way, and Jaime Levy (in the Penthouse Suite of the Standard, Downtown LA).","themes":[{"_type":"reference","_ref":"theme_internet"}],"slug":{"_type":"slug","current":"sex-love-internet-2"}}
{"_id":"imported-jack-goldstein","_type":"event","title":"Jack Goldstein and the Cal Arts Mafia","event_type":"event","event_program":"hardtoread","date":"2018-07-16","start":"19:00","end":"21:00","text":"HARD TO READ PRESENTS JACK GOLDSTEIN AND THE CALARTS MAFIA THE MOVIE WITH MATT DOYLE,  RICHARD HERTZ AND PURITY\n\nIn the Cactus Lounge of the Standard, Hollywood\n\nMatt Doyle discovered American artist Jack Goldstein through Richard Hertz’s book ‘Jack Goldstein and the CalArts Mafia’. An autobiography told through oral history, Hertz’s book tells the story of Goldstein’s successes, failures, and eventually his disappearance from the art world. This evening, Richard will read selections from the book, Matt will present his in-progress adaptation of the book to feature length narrative film, and there will be a performance by the band Purity.\n\nHosted by Fiona Alison Duncan, Hard to Read is a monthly lit series based out of the Standard hotels in Los Angeles.","themes":[{"_type":"reference","_ref":"theme_art"}],"slug":{"_type":"slug","current":"jack-goldstein"}}
{"_id":"imported-sex-love-internet-1","_type":"event","title":"Sex, Love, and the Internet 1","event_type":"event","event_program":"pillowtalk","date":"2018-07-12","text":"On Sex, Love, and the Internet (part 1). With Mandy Harris Williams, Lisa Katnic, Soraya King, Sean Monahan (in the Penthouse Suite of the Standard, Downtown LA).","themes":[{"_type":"reference","_ref":"theme_internet"}],"slug":{"_type":"slug","current":"sex-love-internet-1"}}
{"_id":"imported-resistance-is-futile","_type":"event","title":"Resistance is Futile! on Mental Wellness and Sensuousness","event_type":"event","event_program":"pillowtalk","date":"2018-07-06","start":"18:00","end":"20:00","text":"Join organizing host Fiona Duncan as she brings her two LA-based events series to Toronto for one night of listening and talk. Usually separate events, Hard to Read, a lit series, and Pillow Talk, community organizing on sex, love, and communication, will be coupled for this rooftop garden special — a communal exploration of mental wellness and sensuousness. Featuring contributions by writers Cason Sharpe and Yaniya Lee, poet Rose Georgia Flutur, musician Deidre, yogi Sari Fried, and more, we’ll explore currents like Millennial anxiety, Jordan Peterson and incel, the wellness industry (class, health, and spirituality), eros as a creative force, and more. Promising custom sensitives-sensitive scents by Universal Flowering and light refreshments, this event is part of the Toronto Art Book Fair, curated by Art Metropole.","themes":[{"_type":"reference","_ref":"theme_mental-wellness"},{"_type":"reference","_ref":"theme_sensousness"}],"slug":{"_type":"slug","current":"resistance-is-futile"}}
{"_id":"imported-montez-press-residency-1","_type":"event","title":"Hard to Read on Montez Press Radio Residency 1","event_type":"event","event_program":"hardtoread","date":"2018-07-01","timezone":"EST","action_label":"Link","action_link":"https://radio.montezpress.com/#/archive","text":"At the invitation of Montez Press Radio, Fiona Alison Duncan hosted a summer of conversations with writers, artists and booksellers, culminating in a reading themed AMBITION and/or SHAME. Guests included Jamieson Webster, Sarah McNally, Torey Thornton, Matt Hilvers, Ajakia Smith, Alicia Novella Vasquez, Julien Ceccaldi, Sadaf H Nava, Dean Kissick, Stephanie La Cava. Hosted out of Montez Press Radio headquarters, formerley Mathew Gallery.","themes":[{"_type":"reference","_ref":"theme_radio"}],"slug":{"_type":"slug","current":"montez-press-residency-1"}}
{"_id":"imported-three","_type":"event","title":"Three: Elaine Kahn, Shauna Barbosa, and Sarah LaBrie","event_type":"event","event_program":"pillowtalk","date":"2018-06-05","start":"19:00","end":"21:00","text":"HARD TO READ PRESENTS SHAUNA BARBOSA, ELAINE KAHN, AND SARAH LABRIE\n\n“Language lost on every lick placed on my back.”\n—Shauna Barbosa\n\n“I may look like a real woman but my narrating voice has a long, white beard” \n—Elaine Kahn\n\n“There may be a twist ending of course.”  \n—Sarah LaBrie\n\nYou’re invited to Navel for a very special Hard to Read starring poet Shauna Barbosa (Cape Verdean Blues), writer, musician and artist Elaine Kahn (Women in Public), and writer and librettist Sarah LaBrie. Hosted by Fiona Duncan.","themes":[{"_type":"reference","_ref":"theme_poetry"}],"slug":{"_type":"slug","current":"three"}}
{"_id":"imported-loose-lips","_type":"event","title":"LOOSE LIPS (Gossip 2)","event_type":"event","event_program":"hardtoread","date":"2018-05-08","start":"20:00","end":"22:00","text":"HARD TO READ PRESENTS LOOSE LIPS, A READING ON GOSSIP, HEARSAY, RUMOR, AND MYTH\n\n“I don’t care what is written about me so long as it isn’t true.”\n—Dorothy Parker\n\n\"When words get in the way, there’s really only one thing left to do.”\n—Gossip Girl\n\nJoin us for Hard to Read’s third New York offering and second event on gossip, hearsay, rumor, and myth. Fiona Duncan, Janique Vigier, and Joshua Taylor aka Prince Language will host writer and publisher Stephanie LaCava, writer Dean Kissick, and intellectual sluts slash political pundits Dasha Nekrasova, Anna Khachiyan, and Meg Murnane (of the podcast Red Scare) for a night of opportunistic exchange at Better Days\n\nTuesday May 8th at 7pm\nUpstairs at Better Days\n302 Broome St, New York","themes":[{"_type":"reference","_ref":"theme_gossip"}],"slug":{"_type":"slug","current":"loose-lips"}}
{"_id":"imported-juicy","_type":"event","title":"JUICY (Gossip 1)","event_type":"event","event_program":"hardtoread","date":"2018-05-01","start":"19:00","end":"21:00","text":"HARD TO READ PRESENTS JUICY, A READING ON GOSSIP, HEARSAY, RUMOR, AND MYTH\n\n“We hold this myth to be potential / Not self-evident but equational / Another Dimension / Of another kind of Living Life”  –Sun Ra\n\n“Let’s gossip to get our heart rates up” –Carrie Bradshaw\n\nJoin us for a fiery dish session on delicious truths, compelling lies, notoriety, and who knows! Among our night’s gossips and myth-makers, sharing original and appropriated texts, are poet/dancer Harmony Holiday, artist/musician Negashi Armada, musician Nick Malkin, and party girl and literary charmer Jordan Richman.\n\nTuesday May 1st at 7pm\nAround the Fire Pit of the Standard, Downtown\n550 S. Flower St, Los Angeles, CA","themes":[{"_type":"reference","_ref":"theme_gossip"}],"slug":{"_type":"slug","current":"juicy"}}
{"_id":"imported-lovelace-2","_type":"event","title":"Lovelace 2\n","event_type":"event","event_program":"hardtoread","date":"2018-03-16","action_label":"Link","action_link":"https://www.youtube.com/watch?v=R9pIQxPPgjA","text":"Lovelace in Los Angeles. Celebrating women & the Internet for the launch of Claire L. Evans’ book Broad Band with Claire L. Evans, Alice Barker, Ann Hirsch, Mandy Harris Williams, Martine Syms, Lauren McCarthy, and Jennifer Moon (at Navel.la)","themes":[{"_type":"reference","_ref":"theme_internet"}],"slug":{"_type":"slug","current":"lovelace-2"}}
{"_id":"imported-madness","_type":"event","title":"Madness","event_type":"event","event_program":"hardtoread","date":"2018-03-15","action_label":"Link","action_link":"http://archive.sexmag.info/sexlife/hard-to-read-brandon-drew-holmes-and-rindon-johnson-on-madness/","text":"HARD TO READ PRESENTS MADNESS WITH BRANDON DREW HOLMES, CECILIA CORRIGAN AND RINDON JOHNSON\n\nJoin us for a reading and screening on madness as in anger, wildness, and mental illness; as a natural reaction to crazy circumstances. Artist Brandon Drew Holmes will debut a zine. Writer and performer Cecilia Corrigan will screen her latest video series. Rindon Johnson will read. Music by Deidre. \n\nThis Hard to Read, organized and hosted by Fiona Alison Duncan, is inspired by her latest “Ready-to-read” books collection at Eckhaus Latta’s rEtail shop titled: “Lunacy means moon stuck, Mental means thoughtful, Nutty means delicious, Sick means right on, and Madness is righteous, cos Reality is INSANE!!”\n\nThursday March 15th at 7pm\nIn the Cactus Lounge of The Standard, Hollywood","themes":[{"_type":"reference","_ref":"theme_madness"},{"_type":"reference","_ref":"theme_crazy"},{"_type":"reference","_ref":"theme_angry"}],"slug":{"_type":"slug","current":"madness"}}
{"_id":"imported-lovelace-1","_type":"event","title":"Lovelace 1","event_type":"event","event_program":"hardtoread","date":"2018-03-07","action_label":"Link","action_link":"https://www.ravelinmagazine.com/posts/readings-claire-evanss-broad-band/","text":"Lovelace in New York. Celebrating women & the Internet for the launch of Claire L. Evans’ book Broad Band with Claire L. Evans, Alexandra Marzella, Sougwen Chung, Jacky Connolly, Allison Parrish, Mimi Onuoha, and McKenzie Wark at Bridget Donahue Gallery","themes":[{"_type":"reference","_ref":"theme_internet"}],"slug":{"_type":"slug","current":"lovelace-1"}}
{"_id":"imported-masculinity-a-valentine","_type":"event","title":"Masculinity, a Valentine","event_type":"event","event_program":"hardtoread","date":"2018-02-20","start":"18:00","end":"20:00","timezone":"PST","action_label":"Link","action_link":"https://www.standardhotels.com/la/happenings/hard-to-read-feb18","text":"Masculinity, a Valentine erected and reflected on masculinity as desirable, hormonal, potent, potentially-toxic and as an essence that flows through us us all(?). This public reading connected to a more private Pillow Talk on the same topic, hosted in the penthouse suite of the Standard, Downtown LA the same month. Among the night's readers were performance artist Cade, who read from their Xenomaskuline Manifesto; writer and father Andrew Berardini; activist and incredible hilarious public speaker Adrien Adams (REACH LA); and writers Zaron Burnett III, Rocket Caleshu, and Kyle Thomas Hinton. (Famously, Tracy Jeanne Rosenthal stormed out of this reading, apparently offended by one of the author's shares. Or maybe they had somewhere better to be. A beautifully attended event otherwise.)\n\nOrganized by Fiona Alison Duncan, this live-streamed Hard to Read was co-hosted by actress Dasha Nekrasova (as Fiona wrote in the original event copy: \"catch her before she moves to New York & breaks all our hearts...\")","themes":[{"_type":"reference","_ref":"theme_love"},{"_type":"reference","_ref":"theme_masculinity"}],"links":[{"_type":"externalLink","url":"https://www.aqnb.com/2018/05/16/from-glamour-model-biohacking-gender-trans-masculine-artist-cade-presents-a-xenomaskuline-manifesto","title":"https://www.aqnb.com/2018/05/16/from-glamour-model-biohacking-gender-trans-masculine-artist-cade-presents-a-xenomaskuline-manifesto"},{"_type":"externalLink","url":"https://youtu.be/5ZQlxM_LoEo","title":"https://youtu.be/5ZQlxM_LoEo"}],"slug":{"_type":"slug","current":"masculinity-a-valentine"}}
{"_id":"imported-novembre-communism","_type":"event","title":"Novembre 12 + Solution: Communism","event_type":"event","event_program":"hardtoread","date":"2018-01-27","text":"This Saturday, please join us for the launch of the latests from Novembre Magazine and Sternberg’s Solution Series, both featuring work by Eckhaus Latta Retail Shop book buyer + Hard to Read host Fiona Alison Duncan\n\nNovembre 12 stars Cindy Sherman, Kate Groobey, Renata Raksha, Jeanne-Salomé Rochat, Ready-to-read by Hard to Read by Stefan Schwartzman, and more.\n\nSolution 275-94: Communists Anonymous is edited by Ingo Niermann and Joshua Simon and features writing by Boris Groys, Georgia Sagri, Fiona Duncan, David Pearce, and Elfriede Jelinek, among others.","themes":[{"_type":"reference","_ref":"theme_communists"}],"slug":{"_type":"slug","current":"novembre-communism"}}
{"_id":"imported-body-language","_type":"event","title":"Body Language","event_type":"event","event_program":"hardtoread","date":"2018-01-23","action_label":"Link","action_link":"http://archive.sexmag.info/sexlife/hard-to-read-body-language-photos/","text":"In celebration of the launch of Pillow Talk — a new monthly events series on sex, love, and communication, held in the semi-privacy of the Standard’s penthouse suites — Hard To Read present Body Language, a reading on corporeal communication. Smoldering eyes, winks, smiles, tension, shivers, and sighs, this reading will explore the many ways our bodies communicate with each other, and us. Featuring model, filmmaker, and sex writer Tierney Finster; writer and educator Amanda Williams; pain specialist, Cronenberg embodiment Emily Barker; interdisciplinary artist, researcher, and body double Bebe Yama; Pina Bausch YouTube hits; plus surprise guest Alexandra Marzella.\n\nIn the Lobby Lounge of the Standard, Downtown\n550 S. Flower St., Los Angeles, CA\n\nHosted by Fiona Alison Duncan, Hard to Read is an interdisciplinary reading series housed at the Standard hotels in Los Angeles. Pillow Talk, also hosted by Duncan, will launch on Thursday, January 25th at 7pm in the Penthouse of the Standard, Downtown. Our first event will be co-hosted by Samuel Muglia, Gaea Woods, Tierney Finster, Alice Barker, and Ana Cecilia Alvarez. For more information, please write fad@hardtoread.us.","themes":[{"_type":"reference","_ref":"theme_sex"},{"_type":"reference","_ref":"theme_love"},{"_type":"reference","_ref":"theme_community"},{"_type":"reference","_ref":"theme_body-language"},{"_type":"reference","_ref":"theme_physicality"}],"links":[{"_type":"externalLink","url":"http://archive.sexmag.info/sexlife/hard-to-read-body-language-full-audio/","title":"http://archive.sexmag.info/sexlife/hard-to-read-body-language-full-audio/"}],"slug":{"_type":"slug","current":"body-language"}}
{"_id":"imported-not-alone","_type":"event","title":"Not Alone","event_type":"event","event_program":"hardtoread","date":"2017-12-26","text":"HARD TO READ PRESENTS NOT ALONE. A reading on orphanism, ex-patriotism, displacement, alienation, family, and the holidays starring artist-writers Amanda Horowitz, Audrey Wollen, and Brighid Fitzgerald with Jake Swinson, plus! Sofia Reta Corporation. At the Standard, Hollywood.","themes":[{"_type":"reference","_ref":"theme_loneliness"}],"slug":{"_type":"slug","current":"not-alone"}}
{"_id":"imported-american-dream","_type":"event","title":"I AM THE AMERICAN DREAM","event_type":"event","event_program":"hardtoread","date":"2017-11-17","text":"I AM THE AMERICAN DREAM, a reading with Jenny Zhang, Vanessa Angelica Villarreal, Alake Shilling, Symrin Chawla, and Gelare Khoshgozaran. Co-curated by Diana Buendia","themes":[{"_type":"reference","_ref":"theme_americana"}],"slug":{"_type":"slug","current":"american-dream"}}
{"_id":"imported-angels-flight","_type":"event","title":"Angels Flight: On Voice","event_type":"event","event_program":"hardtoread","date":"2017-10-10","text":"Angels Flight: On Voice\nwith Sadaf H. Nava, Flannery Silva, Nour Mobarak, and Ser Serpas\n(at the Standard DTLA)","themes":[{"_type":"reference","_ref":"theme_voice"}],"slug":{"_type":"slug","current":"angels-flight"}}
{"_id":"imported-talk","_type":"event","title":"Talk","event_type":"event","event_program":"hardtoread","date":"2017-09-26","text":"Talk by Linda Rosenkrantz\nperformed by Sarah Nicole Prickett, Dasha Nekrasova, and Beau Rice, with guest Linda Rosenkrantz.\na benefit for ACLU thanks to author Linda Rosenkrantz and NYRB\n(at the WeHo Standard)","themes":[{"_type":"reference","_ref":"theme_gossip"}],"slug":{"_type":"slug","current":"talk"}}
{"_id":"imported-process-processus","_type":"event","title":"Process/processus","event_type":"event","event_program":"hardtoread","date":"2017-09-16","text":"Process/processus\n(un événement bilingue avec Art Pop à Montreal, QC)\nwith Alix Ferrand, Durga Chew-Bose, Jacob Wren, Michele Nox, Monique Palma Whittaker, and Trevor Gould\n(music by Michele Nox)","themes":[{"_type":"reference","_ref":"theme_processing"}],"slug":{"_type":"slug","current":"process-processus"}}
{"_id":"imported-summer-or-fall","_type":"event","title":"Is it Summer or Fall?","event_type":"event","event_program":"hardtoread","date":"2017-09-12","action_label":"Link","action_link":"\nhttps://www.bridgetdonahue.nyc/exhibitions/ready-read-hard-read-presents-it-summer-or-fall/","text":"Ready-to-read by Hard to Read presents…\n\n“Is it Summer or Fall?”\n\nA NYFW S/S'18 reading featuring:\nAlicia Novella Vasquez\nAriana Reines\nChristopher Glazek\nJulien Ceccaldi\nMarjon Carlos\nand Ser Brandon-Castro Serpas\nwith music by Prince Language\n\nComing to you from the literary haven of Los Angeles, Hard to Read is writer-artist Fiona Alison Duncan’s monthly lit series presently hosted at the Standard hotels. Ready-to-read by Hard to Read is her diffusion line. An ode to the rhythms of fashion time, Ready-to-read consists of collections of books presented alongside the fashion-seasonal calendar and sold out of Eckhaus Latta’s flagship LA shop, plus! synchronistic events. Our New York debut will be held at Bridget Donahue gallery. This New York Fashion Week S/S'18 reading will star: artist-slash-models Ser Brandon-Castro Serpas and Alicia Novella Vasquez, aka @lightlicker; artist and comic book writer Julien Ceccaldi; fashion journalist Marjon Carlos; Ariana Reines, genius poetess and translator of Tiqqun’s Preliminary Materials for a Theory of the Young-Girl (essential fashion victim reading published by Semiotext<e>); and finally, journalist Christopher Glazek, who will rep Gary Indiana’s Three-Month Fever, a novel about Andrew Cunanan, the man who murdered Gianni Versace in 1997, re-editioned this year from Semiotext<e> with an introduction by Glazek. Music styled by DJ and Love Injection magazine literary critic Prince Language will preface and follow the readings. Books and zines will be available for sale.\n\nTuesday, September 12th at 8pm\nat Bridget Donahue Gallery\n99 Bowery, New York, NY","themes":[{"_type":"reference","_ref":"theme_fashion"}],"links":[{"_type":"externalLink","url":"https://www.aqnb.com/2018/03/06/fiona-duncan-introduces-the-hard-to-read-monthly-lit-series-with-a-piece-by-alicia-novella-vasquez/","title":"https://www.aqnb.com/2018/03/06/fiona-duncan-introduces-the-hard-to-read-monthly-lit-series-with-a-piece-by-alicia-novella-vasquez/"}],"slug":{"_type":"slug","current":"summer-or-fall"}}
{"_id":"imported-raised","_type":"event","title":"Raised","event_type":"event","event_program":"hardtoread","date":"2017-07-11","text":"RAISED! An event on how we were and are. With Brontez Purnell (Since I Laid My Burden Down), Michelle Tea (Black Wave), Tzef Montana, and Nicola Knight","themes":[{"_type":"reference","_ref":"theme_fashion"},{"_type":"reference","_ref":"theme_freedom"},{"_type":"reference","_ref":"theme_dicks"}],"slug":{"_type":"slug","current":"raised"}}
{"_id":"imported-belleza-y-felicidad","_type":"event","title":"Belleza y Felicidad","event_type":"event","event_program":"hardtoread","date":"2017-06-24","text":"Belleza y Felicidad \nA bilingual Ready-to-read presentation at Eckhaus Latta\nAmalia Ulman and Stuart Krimko reading work by Argentine artists-poet-friends Fernanda Laguna y Cecilia Pavon","themes":[{"_type":"reference","_ref":"theme_happiness"},{"_type":"reference","_ref":"theme_beauty"},{"_type":"reference","_ref":"theme_poetry"},{"_type":"reference","_ref":"theme_bilingual"}],"slug":{"_type":"slug","current":"belleza-y-felicidad"}}
{"_id":"imported-activisms","_type":"event","title":"Activisms!","event_type":"event","event_program":"hardtoread","date":"2017-06-13","text":"HARD TO READ PRESENTS ACTIVISMS!\n“Don’t agonize, organize.”\n—Flo Kennedy\n\nTuesday, June 13th at 7pm\nIn the lobby of the Standard DTLA\n\nA benefit for ACLU, FreeFrom, MuslimARC, and support.fm with readings, meditations, music, and performances by:\n\nArtist, healer, activist Alexis Blair Penney,\nsex work advocate, author, and porn star Conner Habib of Against Everyone with Conner Habib,\nElection Reform! aka artist Brendan Fowler,\nfemme Afro punk band Fuck U Pay Us,\nKaren L. Ishizuka, author of Serve the People: Making Asian America in the Long Sixties (Verso, 2017),\njournalist, poet, and scholar Dr. Maytha Alhassen,\nand Blaine O'Neill, Cyrus Dunham, and Alice Barker of support.fm.\n\nWith books and merch—gracious donated, to help FUNdrai$e—by: Badlands Unlimited, City Lights (Angela Davis, Mumia Abu-Jamal), Election Reform!, Flo Kennedy, Graywolf (Claudia Rankine, Fanny Howe, Layli Long Soldier, and Maggie Nelson), Harmony Holiday, Ingo Niermann and the Solution Series (Sternberg), Maytha Alhassen and Ahmed Shihab-Eldin (Demanding Dignity), Molly Crabapple, Otherwild, Peter Bagge (Drawn & Quarterly), Sarah Schulman, Semiotext(e), the So Cal Library, and Verso (Karen L. Ishizuka, L.A. Kauffman, and Melissa Gira Grant).\n\n$5 suggested minimum donation.\n\nHosted by Fiona Alison Duncan, this is part of the Standard’s monthly reading series HARD to READ.","themes":[{"_type":"reference","_ref":"theme_activisms"}],"slug":{"_type":"slug","current":"activisms"}}
{"_id":"imported-sex-love-astrology","_type":"event","title":"Sex, Love, and Astrology","event_type":"event","event_program":"pillowtalk","date":"2017-06-07","text":"On Sex, Love, and Astrology.​ With Ariana Reines, Courtney Perkins (@notallgeminis), Shauna Barbosa, and Stuart Krimko (in the Penthouse Suite of the Standard, Downtown LA).","themes":[{"_type":"reference","_ref":"theme_astrology"}],"slug":{"_type":"slug","current":"sex-love-astrology"}}
{"_id":"imported-hollywood-forever","_type":"event","title":"Hollywood Forever ","event_type":"event","event_program":"hardtoread","date":"2017-05-23","action_label":"Link","action_link":"https://www.standardhotels.com/culture/harmony-holiday-durga-chew-bose-hollywood","text":"Harmony Holiday launches Hollywood Forever \nwith Andrew Durbin, Richard Hawkins, and Joseph Mosconi","themes":[{"_type":"reference","_ref":"theme_poetry"}],"slug":{"_type":"slug","current":"hollywood-forever"}}
{"_id":"imported-masculinities-pt","_type":"event","title":"Masculinities","event_type":"event","event_program":"pillowtalk","date":"2017-05-17","text":"Masculinities. ​A group discussion co-hosted by Stefan Schwartzman, Clay Kerrigan, and Fiona Alison Duncan, with a video and talk by Cade Moga, and movement by Sarah Ashkin (in the Penthouse Suite of the Standard, Downtown LA)","themes":[{"_type":"reference","_ref":"theme_gender"}],"slug":{"_type":"slug","current":"masculinities-pt"}}
{"_id":"imported-too-much","_type":"event","title":"Too Much & Not the Mood","event_type":"event","event_program":"hardtoread","date":"2017-05-17","action_label":"Link","action_link":"https://www.ssense.com/en-us/editorial/culture/durga-chew-bose-has-been-so-young-for-so-long","text":"Durga Chew-Bose launches Too Much & Not the Mood\nwith Sarah Nicole Prickett, Cyrus Dunham and Aria Dean\n(at the Hollywood Standard)","themes":[{"_type":"reference","_ref":"theme_friendship"}],"links":[{"_type":"externalLink","url":"https://www.standardhotels.com/culture/harmony-holiday-durga-chew-bose-hollywood","title":"https://www.standardhotels.com/culture/harmony-holiday-durga-chew-bose-hollywood"}],"slug":{"_type":"slug","current":"too-much"}}
{"_id":"imported-everyone-else-durga","_type":"event","title":"Everyone Else with Durga Chew-Bose","event_type":"event","event_program":"hardtoread","date":"2017-05-16","text":"Author Durga Chew-Bose will present EVERYONE ELSE at Cinefamily on Tuesday night, May 16. (The night before the screening, Chew–Bose will launch her new essay collection TOO MUCH AND NOT IN THE MOOD at a Hard to Read event at the Standard Hollywood, joined by Sarah Nicole Prickett, Grace Dunham, Aria Dean, and Fiona Duncan)","themes":[{"_type":"reference","_ref":"theme_film"}],"slug":{"_type":"slug","current":"everyone-else-durga"}}
{"_id":"imported-bottle-service","_type":"event","title":"Bottle service for enablement","event_type":"event","event_program":"hardtoread","date":"2017-04-25","text":"“BOTTLE SERVICE FOR ENABLEMENT”\nA reading featuring…\n\nFrancesca Lia Block,\nAmanda Yates Garcia,\nSojourner Truth Parsons,\nSuné Woods,\nand Jacky Flowers!\n\nJacky Flowers, aka saoirse or sairsha felony thirty three, could be a character in one of Francesca Lia Block’s early novels. Witch Baby. Baby Be-Bop. Weetzie Bat. Or ...and the Goat Guys. Though he, like she, is really just living fantastically. You should come see them! A poet and artist, sly braving shy, Flowers has a ripe life of twelve house dispersion ahead -nay on all temporal sides of him, and she, Block, has a memoir forthcoming (The Thorn Necklace: Turning Pain into Art, 2018, Seal Press). Also a magician who could be a Lia Block fiction, Amanda Yates Garcia is a professional witch, artist, writer, and healer, “the Oracle of Los Angeles.” She’ll entrance you for a fair fee, and can perform Reiki, read astrology, draw tarot, teach tantra, and/or intuit what else we may need, like (who doesn’t need?) a spell to mend a broken heart, which she’s committed to share on this evening for free. As our series, Hard to Read, always is. (We suggest you buy drinks and books instead. Copies of Rough Magick, an anthology with work by Garcia, edited by Block, will be available for sale.) What’s more: Sojourner Truth Parsons and Suné Woods, both LA-based artists, will join us. Intimately working for and with real stakes, Parsons paints, while Woods video makes, takes photos, and collages, enmeshing image and word, as she will for us, with slides. All five—Flowers through Woods—will read under the title theme “Bottle service for enablement,” which is a vague-enough line to embrace our lot, and our setting, drawn from one of Jacky’s poems that ends:\n\nWishing i could remember, but\n\ni’m generally in a pleasant mood, as i remember\nForgetful attitude is a comfort mask","themes":[{"_type":"reference","_ref":"theme_trouble"}],"slug":{"_type":"slug","current":"bottle-service"}}
{"_id":"imported-on-camera","_type":"event","title":"On Camera","event_type":"event","event_program":"pillowtalk","date":"2017-04-18","action_label":"Link","action_link":"http://the-editorialmagazine.com/pillow-talk-at-the-standard/","text":"On Camera. A group photoshoot lead by model Tzef Montana, styled by Autumn Randolph (thanks to Eckhaus Latta and No Sesso), and photographed by Jasper Briggs (in the Penthouse Suite of the Standard, Downtown LA).","themes":[{"_type":"reference","_ref":"theme_performance"}],"slug":{"_type":"slug","current":"on-camera"}}
{"_id":"imported-many-waters","_type":"event","title":"Many Waters","event_type":"event","event_program":"pillowtalk","date":"2017-03-22","text":"Many Waters.​ A community movement class care of Alexis Blair Penney, fundraising for the Trans Assistance Project (in the Penthouse Suite of the Standard, Downtown LA)","themes":[{"_type":"reference","_ref":"theme_expansion"},{"_type":"reference","_ref":"theme_relaxation"}],"slug":{"_type":"slug","current":"many-waters"}}
{"_id":"imported-poetry-night","_type":"event","title":"Poetry Night","event_type":"event","event_program":"hardtoread","date":"2017-03-21","text":"A night of poetry (plus Yasi) with Will Alexander, Stuart Krimko, Peter Nowogrodzki, and Yasi Salek","themes":[{"_type":"reference","_ref":"theme_poetry"}],"slug":{"_type":"slug","current":"poetry-night"}}
{"_id":"imported-tall-poppies","_type":"event","title":"Tall Poppies at Grey Gardens","event_type":"event","event_program":"hardtoread","date":"2017-03-14","text":"TALL POPPIES. A Canadian event at Jen Agg's Grey Gardens restaurant. With readers Jen Agg, Hoa Nguyen, Tracy Van Oosten, Tamara Faith Berger, and Rosemary Georgia Flutur","themes":[{"_type":"reference","_ref":"theme_canada"}],"slug":{"_type":"slug","current":"tall-poppies"}}
{"_id":"imported-abcdhst-laabf","_type":"event","title":"ABCDHST x LAABF","event_type":"event","event_program":"hardtoread","date":"2017-02-22","text":"Readings by artists during the Los Angeles Art Book Fair. With artists Rosa Aiello, Hannah Black, Victoria Chey, Mackenzie Davis, Margaret Haines, Kia Smith, and Marisa Takal\n(DJs Cuntry Noise x Bebe Yama)","themes":[{"_type":"reference","_ref":"theme_art"}],"slug":{"_type":"slug","current":"abcdhst-laabf"}}
{"_id":"imported-rather-be-free","_type":"event","title":"We’d Rather Be Free","event_type":"event","event_program":"pillowtalk","date":"2017-02-13","action_label":"Link","action_link":"http://sexmagazine.us/sexlife/pillow-talk-wed-rather-be-free-notes-and-videos/","text":"We’d Rather Be Free. ​A femme-centered conversation on power, abuse, sex, and gender, co-hosted by Ana Cecilia Alvarez, Dasha Nekrasova, Amalia Ulman, Larissa Pham, Tierney Finster, Paula Kahn, and Dr. Jane Ward, with guests (in the Penthouse Suite of the Standard, Downtown LA).","themes":[{"_type":"reference","_ref":"theme_freedom"},{"_type":"reference","_ref":"theme_abuse"},{"_type":"reference","_ref":"theme_sex"},{"_type":"reference","_ref":"theme_power"},{"_type":"reference","_ref":"theme_pleasure"}],"links":[{"_type":"externalLink","url":"https://www.standardhotels.com/culture/pillow-talk-me-too-downtown-la","title":"https://www.standardhotels.com/culture/pillow-talk-me-too-downtown-la"},{"_type":"externalLink","url":"https://www.youtube.com/watch?v=bNym_LuicE4&t=412s&ab_channel=FionaAlisonDuncan","title":"https://www.youtube.com/watch?v=bNym_LuicE4&t=412s&ab_channel=FionaAlisonDuncan"}],"slug":{"_type":"slug","current":"rather-be-free"}}
{"_id":"imported-subtle-bodies","_type":"event","title":"Subtle Bodies ","event_type":"event","event_program":"hardtoread","date":"2017-02-07","text":"“Subtle Bodies: A Reading”\n\nwith\n\nAlexis Blair Penney\nGuru Jagat\nNina Cristante\nSenay Kenfe\nand Tommy Pico\n\n*\n\nIn light of light, a reading themed: “Subtle Bodies,” starring Dharma\nartist, entrepreneur, Kundalini yoga & meditation teacher, and author of\nInvincible Living, Guru Jagat, who will open us up with one of her\nsignature practices. After that, we’ll get to hear, in some sort of order:\nSenay Kenfe, of Long Beach, California, whose genius flows like no other;\nTommy Pico, a self-described “ndn poet-thing” and author of IRL, in from\nNew York City; artist, nutritionist, and personal trainer, Nina Cristante,\nhere from London (originally: Italy); and finally, Alexis Blair Penney, a\nrecent transplant to our City of Angels, but it’s like he—musician, artist,\nqueer anarchistic, mystic, yogic, candid social sharer—was always here.\nBlair will read, lead, and DJ. Come n listen with us.","themes":[{"_type":"reference","_ref":"theme_awakening"}],"slug":{"_type":"slug","current":"subtle-bodies"}}
{"_id":"imported-pillow-talk-intro","_type":"event","title":"Pillow Talk Introductory Mixer","event_type":"event","event_program":"pillowtalk","date":"2017-01-23","action_label":"Link","action_link":"http://archive.sexmag.info/sexlife/pillow-talk-no-1-secretarys-notes-highlights/","text":"Introductory Mixer.​ Co-hosted by Ana Cecilia Alvarez, Tierney Finster, Alice Barker, Samuel Muglia, Gaea Woods, and Fiona Alison Duncan, with guest Mandy Harris Williams (in the Penthouse Suite of the Standard, Downtown LA) #firsteverPillowTalk","themes":[{"_type":"reference","_ref":"theme_pillows"}],"links":[{"_type":"externalLink","url":"https://www.standardhotels.com/culture/Sex-Downtown-LA-Fiona-Alison-Duncan-Tierney-Finster","title":"https://www.standardhotels.com/culture/Sex-Downtown-LA-Fiona-Alison-Duncan-Tierney-Finster"}],"slug":{"_type":"slug","current":"pillow-talk-intro"}}
{"_id":"imported-discipline-anarchy","_type":"event","title":"Discipline & Anarchy","event_type":"event","event_program":"hardtoread","date":"2017-01-17","text":"Discipline & Anarchy was an event inspired by Kathy Acker (words on one of her tattoo doodles). Featuring Chris Kraus, Matias Viegener, McKenzie Wark, Ana Cecilia Alvarez and Chloe Maratta. DJ Henry Hopper. at the Standard, DTLA. ","themes":[{"_type":"reference","_ref":"theme_kathy-acker"}],"slug":{"_type":"slug","current":"discipline-anarchy"}}
{"_id":"imported-romantic-comedy","_type":"event","title":"Romantic Comedy","event_type":"event","event_program":"hardtoread","date":"2016-12-20","text":"ROMANTIC COMEDY: A READING\n\nStarring:\nDean Kissick\nGene McHugh\nEugene Kotlyarenko\nAnn Hirsch\nAnastasia Davydova\n& Dasha Nekrasova\n\nDJ Senay Kenfe\n\n*\n\nEugene used to sleep on Dean’s couch, now he’s making a movie starring Dasha, who lives with Anastasia, who’s obsessed with Dean’s social media. Lately, Anastasia has been writing on society and media, aka porn, a realm that artist Ann also happens to be an expert on, for better and worse. For richer and poorer, to love and to cherish, Ann is married to Gene, whose name rhymes with a lot of things, and is something of a genius, but who isn’t? (He also writes.) We all believe in art, and love, not like making it is easy. On Tuesday, December 20th, join us—Dean, Gene, Eugene, Ann, Anastasia, and Dasha, plus our host, Fiona, who humiliatingly wrote this—for a set of readings on “Romantic Comedy,” a favorite genre that’s worth the struggle to get right.  at the Standard, DTLA. ","themes":[{"_type":"reference","_ref":"theme_trouble"}],"slug":{"_type":"slug","current":"romantic-comedy"}}
{"_id":"imported-kool-ad-ok","_type":"event","title":"Kool AD: O.K.","event_type":"event","event_program":"hardtoread","date":"2016-11-15","action_label":"Link","action_link":"https://lareviewofbooks.org/article/233821/","text":"KOOL A.D. launches O.K. (Sorry House)\nwith Ayesha Siddiqi, Cult Days, Melissa Broder, and Mira Gonzalez \n(DJ nite jewel)  at the Standard, DTLA. ","themes":[{"_type":"reference","_ref":"theme_intelligence"},{"_type":"reference","_ref":"theme_cosmic"}],"links":[{"_type":"externalLink","url":"https://www.standardhotels.com/culture/kool-ad-hard-to-read-fiona-alison-duncan-OK-reading-series-dtla","title":"https://www.standardhotels.com/culture/kool-ad-hard-to-read-fiona-alison-duncan-OK-reading-series-dtla"}],"slug":{"_type":"slug","current":"kool-ad-ok"}}
{"_id":"imported-surveys","_type":"event","title":"Surveys","event_type":"event","event_program":"hardtoread","date":"2015-10-25","action_label":"Link","action_link":"https://www.standardhotels.com/culture/Book-Launch-Natasha-Stagg-Tierney-Finster-Jasmine-Nyende-Amalia-Ulman","text":"Natasha Stagg debuts Surveys (Semiotexte)\nwith Amalia Ulman, Jasmine Nyende, and Tierney Finster \n(DJ Jimi Hey) at the Standard, DTLA #firsteverH2R","themes":[{"_type":"reference","_ref":"theme_internet"},{"_type":"reference","_ref":"theme_it-girls"}],"slug":{"_type":"slug","current":"surveys"}}
{"_id":"imported-art-geneva","_type":"event","title":"Art Geneva Fragile Booth","event_type":"exhibition","event_program":"hardtoread","action_label":"Link","action_link":"http://www.fragile.berlin/artgeneve","text":"Hard to Read exhibited at Art Geneva within Fragile's booth. Hard to Read presented “A tease that’s a bond, not a separation,” audio piece composed of readings and song by Tarren Johnson, Mahsa Saloor, Alix Ferrand (Cucuruchaa), 3lsn3r, Dan Bodan & Fiona Alison Duncan. Exhibited alongside works by SOPHIE, Analisa Teachworth, Dese, and Kandis Williams ","themes":[{"_type":"reference","_ref":"theme_art"}],"slug":{"_type":"slug","current":"art-geneva"}}
{"_id":"imported-exquisite-mariposa-book-tour","_type":"event","title":"Exquisite Mariposa Book Tour","event_type":"event","event_program":"hardtoread","action_label":"Link","action_link":"https://softskull.com/dd-product/exquisite-mariposa/","text":"Exquisite Mariposa by Fiona Alison Duncan, Debut Novel Book Tour\n\n“PIGEONS & PILOTS.” Official launch with Dean Kissick. At Primo’s Tribeca, 129 Chambers St, New York, NY. 7pm doors, Tuesday, October 1st, 2019.\n\n“COCOONS.” With Ariela Freedman and Alix Van Der Donckt-Ferrand. At Librairie Drawn & Quarterly, 211 Rue Bernard O, Montreal, QC. 7pm doors, Thursday, October 10th.\n\n“DRIVES.” At Octopus Books, 116 Third Ave, Ottawa, ON. 7pm doors, Tuesday, October 15th.\n\n“TWENTIES.” With Sybil Prentice and Fan Wu. At Art Metropole in the Museum of Contemporary Art, 158 Sterling Road, Toronto, ON. 7.30pm start, Friday, October 18th, 2019.\n\n“FLOWERS.” With Pamela Des Barres and Jacky Flowers. On the Rooftop Garden of the Standard, Downtown LA, 550 S. Flower St, Los Angeles, CA. 7pm doors, Tuesday, October 22nd, 2019.\n\n“THE REAL?” With Jamieson Webster. At McNally Jackson (Seaport), 4 Fulton St, New York, NY. 7pm start, Thursday, October 24th, 2019.\n\n“PARIS\" with Matt Hilvers. At After 8 Books in Paris","themes":[{"_type":"reference","_ref":"theme_butterflies"}],"slug":{"_type":"slug","current":"exquisite-mariposa-book-tour"}}